zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
#include <Arduino.h>
#include <M5Stack.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_arduino_version.h>

#define BOARD_NAME "M5Stack Core ESP32"
#define DEVICE_ROLE "m5GatewayMonitor"
#define ESPNOW_CHANNEL 1
#define SERIAL_BAUD 115200
#define SERIAL_LINE_BUFFER_SIZE 192
#define DISPLAY_REFRESH_MS 1000
#define STATUS_PRINT_MS 1000
#define SERIAL_TIMEOUT_MS 3000
#define MIC_STATUS_TIMEOUT_MS 3000
#define CONTROL_SEND_REPEATS 5
#define CONTROL_SEND_REPEAT_DELAY_MS 20
#define DREAM_PACKET_MAGIC 0x44524541UL
#define DREAM_PROTOCOL_VERSION 1
#define PRESSURE_SENSOR_PIN -1
#define PRESSURE_SENSOR_ACTIVE_LEVEL HIGH
#define PRESSURE_SENSOR_DEBOUNCE_MS 50
#define BUBBLE_DEFAULT_REVERSE_STEPS 1600
#define BUBBLE_DEFAULT_FOG_START_AT_MS 1000
#define BUBBLE_DEFAULT_FAN_LIGHT_START_AT_MS 5000
#define BUBBLE_DEFAULT_FORWARD_START_AT_MS 9000
#define BUBBLE_DEFAULT_FORWARD_STEPS 1600
#define BUBBLE_DEFAULT_FOG_STOP_AT_MS 12700
#define BUBBLE_DEFAULT_FAN_STOP_AT_MS 13700
#define BUBBLE_DEFAULT_LIGHT_STOP_AT_MS 16700

const uint8_t BROADCAST_MAC[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

enum DreamPacketType : uint8_t {
  DREAM_PACKET_EEG = 1,
  DREAM_PACKET_MIC_STATUS = 2,
  DREAM_PACKET_CONTROL = 3,
  DREAM_PACKET_VIBRATION_STATUS = 4,
};

enum DreamPacketFlags : uint8_t {
  EEG_FLAG_SIGNAL_OK = 1 << 0,
  EEG_FLAG_SOURCE_TIMEOUT = 1 << 1,
  EEG_FLAG_CHECKSUM_OK = 1 << 2,
};

enum DreamLightMode : uint8_t {
  LIGHT_OFF,
  LIGHT_IDLE,
  LIGHT_EEG_BLEND,
  LIGHT_SIGNAL_BAD,
  LIGHT_TIMEOUT,
  LIGHT_MANUAL,
};

enum DreamStepperState : uint8_t {
  STEPPER_DISABLED,
  STEPPER_IDLE,
  STEPPER_MOVING,
  STEPPER_BREATHING,
  STEPPER_LIMITED,
  STEPPER_FAULT,
};

enum DreamRelayState : uint8_t {
  RELAY_OFF,
  RELAY_ARMING,
  RELAY_ON,
  RELAY_COOLDOWN,
  RELAY_FAULT,
};

enum DreamBubbleState : uint8_t {
  BUBBLE_IDLE,
  BUBBLE_REVERSE_PULL,
  BUBBLE_FOG_ON,
  BUBBLE_BLOW_OUT,
  BUBBLE_FORWARD_RESET,
  BUBBLE_FOG_HOLD,
  BUBBLE_WIND_DOWN,
  BUBBLE_LIGHT_HOLD,
};

enum DreamSafetyState : uint8_t {
  SAFETY_NORMAL,
  SAFETY_SIGNAL_BAD,
  SAFETY_LINK_TIMEOUT,
  SAFETY_ESTOP,
  SAFETY_FAULT,
};

enum DreamControlAction : uint8_t {
  CONTROL_NONE,
  CONTROL_SYSTEM_ENABLE,
  CONTROL_SYSTEM_DISABLE,
  CONTROL_LIGHT_AUTO,
  CONTROL_LIGHT_COLOR,
  CONTROL_LIGHT_OFF,
  CONTROL_RELAY_ON,
  CONTROL_RELAY_OFF,
  CONTROL_STEPPER_FORWARD,
  CONTROL_STEPPER_BACKWARD,
  CONTROL_STEPPER_STOP,
  CONTROL_ALL_STOP,
  CONTROL_FAN_ON,
  CONTROL_FAN_OFF,
  CONTROL_BUBBLE_TRIGGER,
  CONTROL_BUBBLE_CONFIG,
  CONTROL_VIBRATION_ENABLE,
  CONTROL_VIBRATION_DISABLE,
};

struct __attribute__((packed)) DreamEegEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t reserved;
  uint32_t eegPower[8];
  uint16_t checksum;
};

struct __attribute__((packed)) DreamMicStatusPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t uptimeMs;
  uint32_t lastEegSeq;
  uint32_t eegAgeMs;
  uint32_t rxCount;
  uint32_t dropCount;
  uint32_t timeoutCount;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t lightLevel;
  uint8_t lightMode;
  uint8_t light1R;
  uint8_t light1G;
  uint8_t light1B;
  uint8_t light1W;
  uint8_t light2R;
  uint8_t light2G;
  uint8_t light2B;
  uint8_t light2W;
  uint8_t stepperState;
  uint8_t relayState;
  uint8_t safetyState;
  uint32_t controlRxCount;
  uint8_t lastControlAction;
  uint8_t manualLightEnabled;
  uint8_t relayOutputEnabled;
  uint8_t stepperOutputEnabled;
  uint8_t systemEnabled;
  uint8_t fanState;
  uint8_t bubbleState;
  uint8_t bubbleOutputEnabled;
  uint8_t reserved2;
  uint32_t bubbleTriggerCount;
  uint32_t bubbleActiveMs;
  uint16_t checksum;
};

struct __attribute__((packed)) DreamControlEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t action;
  uint8_t reserved;
  uint16_t arg1;
  uint16_t arg2;
  uint16_t arg3;
  uint16_t arg4;
  uint16_t arg5;
  uint16_t arg6;
  uint16_t arg7;
  uint16_t arg8;
  uint16_t checksum;
};

struct __attribute__((packed)) DreamVibrationStatusPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint16_t sensorValue;
  uint8_t vibrationDetected;
  uint8_t bubbleState;
  uint32_t timestamp;
  uint8_t checksum;
};

DreamEegEspNowPacket latestEegPacket = {};
DreamMicStatusPacket latestMicStatus = {};
DreamVibrationStatusPacket latestVibrationStatus = {};
DreamControlEspNowPacket latestBubbleConfigPacket = {};

char serialLine[SERIAL_LINE_BUFFER_SIZE] = {};
uint8_t serialLineIndex = 0;
uint32_t serialFrameCount = 0;
uint32_t serialErrorCount = 0;
uint32_t espNowSendCount = 0;
uint32_t espNowSendFailCount = 0;
uint32_t controlRxCount = 0;
uint32_t controlSendCount = 0;
uint32_t controlSendFailCount = 0;
uint32_t localControlSeq = 0;
uint32_t espNowLastSendMs = 0;
uint32_t lastSerialFrameMs = 0;
uint32_t lastMicStatusMs = 0;
uint32_t lastDisplayRefreshMs = 0;
uint32_t lastStatusPrintMs = 0;
bool espNowReady = false;
bool haveEeg = false;
bool haveMicStatus = false;
bool haveVibrationStatus = false;
bool haveBubbleConfigPacket = false;
bool pressurePressed = false;
bool pressureStablePressed = false;
bool pressureLastRawPressed = false;
uint32_t pressureLastChangeMs = 0;
uint32_t pressureLastTriggerMs = 0;
uint32_t pressureTriggerCount = 0;
uint32_t lastVibrationStatusMs = 0;
uint32_t vibrationTriggerCount = 0;
bool lastVibrationDetected = false;
bool vibrationTriggerPending = false;
bool vibrationInputEnabled = true;
uint32_t vibrationLastTriggerMs = 0;
esp_now_send_status_t lastSendStatus = ESP_NOW_SEND_FAIL;

uint16_t packetChecksum(const uint8_t *data, size_t length) {
  uint32_t sum = 0;
  for (size_t i = 0; i < length; i++) {
    sum += data[i];
  }
  return static_cast<uint16_t>(sum & 0xFFFF);
}

template <typename Packet>
uint16_t calculatePacketChecksum(const Packet &packet) {
  return packetChecksum(reinterpret_cast<const uint8_t *>(&packet), sizeof(Packet) - sizeof(packet.checksum));
}

