zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
const char *lightModeName(uint8_t value) {
  switch (value) {
    case LIGHT_OFF: return "OFF";
    case LIGHT_IDLE: return "IDLE";
    case LIGHT_EEG_BLEND: return "EEG";
    case LIGHT_SIGNAL_BAD: return "BAD";
    case LIGHT_TIMEOUT: return "TIMEOUT";
    case LIGHT_MANUAL: return "MANUAL";
    default: return "?";
  }
}

const char *stepperStateName(uint8_t value) {
  switch (value) {
    case STEPPER_DISABLED: return "DISABLED";
    case STEPPER_IDLE: return "IDLE";
    case STEPPER_MOVING: return "MOVING";
    case STEPPER_BREATHING: return "BREATH";
    case STEPPER_LIMITED: return "LIMIT";
    case STEPPER_FAULT: return "FAULT";
    default: return "?";
  }
}

const char *relayStateName(uint8_t value) {
  switch (value) {
    case RELAY_OFF: return "OFF";
    case RELAY_ARMING: return "ARMING";
    case RELAY_ON: return "ON";
    case RELAY_COOLDOWN: return "COOL";
    case RELAY_FAULT: return "FAULT";
    default: return "?";
  }
}

const char *bubbleStateName(uint8_t value) {
  switch (value) {
    case BUBBLE_IDLE: return "IDLE";
    case BUBBLE_REVERSE_PULL: return "REV";
    case BUBBLE_FOG_ON: return "FOG";
    case BUBBLE_BLOW_OUT: return "BLOW";
    case BUBBLE_FORWARD_RESET: return "FWD";
    case BUBBLE_FOG_HOLD: return "FOG_HOLD";
    case BUBBLE_WIND_DOWN: return "WIND";
    case BUBBLE_LIGHT_HOLD: return "LIGHT";
    default: return "?";
  }
}

const char *safetyStateName(uint8_t value) {
  switch (value) {
    case SAFETY_NORMAL: return "NORMAL";
    case SAFETY_SIGNAL_BAD: return "SIGNAL";
    case SAFETY_LINK_TIMEOUT: return "TIMEOUT";
    case SAFETY_ESTOP: return "ESTOP";
    case SAFETY_FAULT: return "FAULT";
    default: return "?";
  }
}

uint16_t ageColor(uint32_t ageMs, uint32_t warnMs, uint32_t badMs) {
  if (ageMs < warnMs) {
    return 0x07E0;
  }
  if (ageMs < badMs) {
    return 0xFFE0;
  }
  return 0xF800;
}

uint16_t signalColor(uint8_t poorSignal) {
  if (poorSignal <= 50) {
    return 0x07E0;
  }
  if (poorSignal <= 120) {
    return 0xFFE0;
  }
  return 0xF800;
}

void printMacAddress(const uint8_t *mac) {
  for (uint8_t i = 0; i < 6; i++) {
    if (mac[i] < 0x10) {
      Serial.print("0");
    }
    Serial.print(mac[i], HEX);
    if (i < 5) {
      Serial.print(":");
    }
  }
}

bool readCsvNumber(char *&cursor, uint32_t &value) {
  while (*cursor == ' ' || *cursor == '\t' || *cursor == ',') {
    cursor++;
  }

  if (*cursor < '0' || *cursor > '9') {
    return false;
  }

  char *endPtr = cursor;
  value = strtoul(cursor, &endPtr, 10);
  cursor = endPtr;
  return true;
}

bool readCsvToken(char *&cursor, char *token, size_t tokenSize) {
  while (*cursor == ' ' || *cursor == '\t' || *cursor == ',') {
    cursor++;
  }

  if (*cursor == '\0' || tokenSize == 0) {
    return false;
  }

  size_t index = 0;
  while (*cursor != '\0' && *cursor != ',') {
    if (index + 1 < tokenSize) {
      token[index++] = *cursor;
    }
    cursor++;
  }
  token[index] = '\0';
  return index > 0;
}

uint8_t controlActionFromName(const char *actionName) {
  if (strcmp(actionName, "SYSTEM_ENABLE") == 0) {
    return CONTROL_SYSTEM_ENABLE;
  }
  if (strcmp(actionName, "SYSTEM_DISABLE") == 0) {
    return CONTROL_SYSTEM_DISABLE;
  }
  if (strcmp(actionName, "LIGHT_AUTO") == 0) {
    return CONTROL_LIGHT_AUTO;
  }
  if (strcmp(actionName, "LIGHT_COLOR") == 0) {
    return CONTROL_LIGHT_COLOR;
  }
  if (strcmp(actionName, "LIGHT_OFF") == 0) {
    return CONTROL_LIGHT_OFF;
  }
  if (strcmp(actionName, "RELAY_ON") == 0) {
    return CONTROL_RELAY_ON;
  }
  if (strcmp(actionName, "RELAY_OFF") == 0) {
    return CONTROL_RELAY_OFF;
  }
  if (strcmp(actionName, "STEPPER_FORWARD") == 0) {
    return CONTROL_STEPPER_FORWARD;
  }
  if (strcmp(actionName, "STEPPER_BACKWARD") == 0) {
    return CONTROL_STEPPER_BACKWARD;
  }
  if (strcmp(actionName, "STEPPER_STOP") == 0) {
    return CONTROL_STEPPER_STOP;
  }
  if (strcmp(actionName, "ALL_STOP") == 0) {
    return CONTROL_ALL_STOP;
  }
  if (strcmp(actionName, "FAN_ON") == 0) {
    return CONTROL_FAN_ON;
  }
  if (strcmp(actionName, "FAN_OFF") == 0) {
    return CONTROL_FAN_OFF;
  }
  if (strcmp(actionName, "BUBBLE_TRIGGER") == 0) {
    return CONTROL_BUBBLE_TRIGGER;
  }
  if (strcmp(actionName, "BUBBLE_CONFIG") == 0) {
    return CONTROL_BUBBLE_CONFIG;
  }
  if (strcmp(actionName, "VIBRATION_ENABLE") == 0) {
    return CONTROL_VIBRATION_ENABLE;
  }
  if (strcmp(actionName, "VIBRATION_DISABLE") == 0) {
    return CONTROL_VIBRATION_DISABLE;
  }
  return CONTROL_NONE;
}

bool parseEegLine(char *line, DreamEegEspNowPacket &packet) {
  if (strncmp(line, "EEG,", 4) != 0) {
    return false;
  }

  char *cursor = line + 4;
  uint32_t values[13] = {};
  for (uint8_t i = 0; i < 13; i++) {
    if (!readCsvNumber(cursor, values[i])) {
      return false;
    }
  }

  memset(&packet, 0, sizeof(packet));
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_EEG;
  packet.seq = values[0];
  packet.pcTimeMs = values[1];
  packet.m5UptimeMs = millis();
  packet.poorSignal = static_cast<uint8_t>(constrain(static_cast<int>(values[2]), 0, 255));
  packet.attention = static_cast<uint8_t>(constrain(static_cast<int>(values[3]), 0, 100));
  packet.meditation = static_cast<uint8_t>(constrain(static_cast<int>(values[4]), 0, 100));
  packet.flags = EEG_FLAG_CHECKSUM_OK;
  if (packet.poorSignal <= 120) {
    packet.flags |= EEG_FLAG_SIGNAL_OK;
  }

  for (uint8_t i = 0; i < 8; i++) {
    packet.eegPower[i] = values[5 + i];
  }

  packet.checksum = calculatePacketChecksum(packet);
  return true;
}

bool parseControlLine(char *line, DreamControlEspNowPacket &packet) {
  if (strncmp(line, "CMD,", 4) != 0) {
    return false;
  }

  char *cursor = line + 4;
  uint32_t seq = 0;
  uint32_t pcTimeMs = 0;
  char actionName[28] = {};
  uint32_t args[8] = {};

  if (!readCsvNumber(cursor, seq) ||
      !readCsvNumber(cursor, pcTimeMs) ||
      !readCsvToken(cursor, actionName, sizeof(actionName))) {
    return false;
  }

  const uint8_t action = controlActionFromName(actionName);
  if (action == CONTROL_NONE) {
    return false;
  }

