zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
  for (uint8_t i = 0; i < 8; i++) {
    if (!readCsvNumber(cursor, args[i])) {
      args[i] = 0;
    }
  }

  memset(&packet, 0, sizeof(packet));
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_CONTROL;
  packet.seq = seq;
  packet.pcTimeMs = pcTimeMs;
  packet.m5UptimeMs = millis();
  packet.action = action;
  packet.arg1 = static_cast<uint16_t>(constrain(static_cast<int>(args[0]), 0, 65535));
  packet.arg2 = static_cast<uint16_t>(constrain(static_cast<int>(args[1]), 0, 65535));
  packet.arg3 = static_cast<uint16_t>(constrain(static_cast<int>(args[2]), 0, 65535));
  packet.arg4 = static_cast<uint16_t>(constrain(static_cast<int>(args[3]), 0, 65535));
  packet.arg5 = static_cast<uint16_t>(constrain(static_cast<int>(args[4]), 0, 65535));
  packet.arg6 = static_cast<uint16_t>(constrain(static_cast<int>(args[5]), 0, 65535));
  packet.arg7 = static_cast<uint16_t>(constrain(static_cast<int>(args[6]), 0, 65535));
  packet.arg8 = static_cast<uint16_t>(constrain(static_cast<int>(args[7]), 0, 65535));
  packet.checksum = calculatePacketChecksum(packet);
  return true;
}

void sendEegToMicroduino() {
  if (!espNowReady || !haveEeg) {
    return;
  }

  latestEegPacket.m5UptimeMs = millis();
  latestEegPacket.checksum = 0;
  latestEegPacket.checksum = calculatePacketChecksum(latestEegPacket);

  const esp_err_t result = esp_now_send(BROADCAST_MAC,
                                        reinterpret_cast<const uint8_t *>(&latestEegPacket),
                                        sizeof(latestEegPacket));
  if (result == ESP_OK) {
    espNowSendCount++;
    espNowLastSendMs = millis();
  } else {
    espNowSendFailCount++;
  }
}

void sendControlToMicroduino(DreamControlEspNowPacket &packet) {
  if (!espNowReady) {
    controlSendFailCount++;
    return;
  }

  bool sent = false;
  esp_err_t lastResult = ESP_OK;
  for (uint8_t attempt = 0; attempt < CONTROL_SEND_REPEATS; attempt++) {
    packet.m5UptimeMs = millis();
    packet.checksum = 0;
    packet.checksum = calculatePacketChecksum(packet);

    lastResult = esp_now_send(BROADCAST_MAC,
                              reinterpret_cast<const uint8_t *>(&packet),
                              sizeof(packet));
    if (lastResult == ESP_OK) {
      sent = true;
      espNowSendCount++;
      espNowLastSendMs = millis();
    } else {
      espNowSendFailCount++;
    }

    if (attempt + 1 < CONTROL_SEND_REPEATS) {
      delay(CONTROL_SEND_REPEAT_DELAY_MS);
    }
  }

  if (sent) {
    controlSendCount++;
    Serial.print("EVENT=CONTROL_TX SEQ=");
    Serial.print(packet.seq);
    Serial.print(" ACTION=");
    Serial.print(packet.action);
    Serial.print(" REPEATS=");
    Serial.println(CONTROL_SEND_REPEATS);
  } else {
    controlSendFailCount++;
    Serial.print("EVENT=CONTROL_TX_FAIL SEQ=");
    Serial.print(packet.seq);
    Serial.print(" ERR=");
    Serial.println(lastResult);
  }
}

void sendLocalControl(uint8_t action,
                      uint16_t arg1 = 0,
                      uint16_t arg2 = 0,
                      uint16_t arg3 = 0,
                      uint16_t arg4 = 0,
                      uint16_t arg5 = 0,
                      uint16_t arg6 = 0,
                      uint16_t arg7 = 0,
                      uint16_t arg8 = 0) {
  DreamControlEspNowPacket packet = {};
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_CONTROL;
  packet.seq = localControlSeq++;
  packet.pcTimeMs = millis();
  packet.m5UptimeMs = millis();
  packet.action = action;
  packet.arg1 = arg1;
  packet.arg2 = arg2;
  packet.arg3 = arg3;
  packet.arg4 = arg4;
  packet.arg5 = arg5;
  packet.arg6 = arg6;
  packet.arg7 = arg7;
  packet.arg8 = arg8;
  packet.checksum = calculatePacketChecksum(packet);
  controlRxCount++;
  sendControlToMicroduino(packet);
}

void setBubbleConfigPacket(DreamControlEspNowPacket &packet,
                           uint16_t reverseSteps,
                           uint16_t fogStartAtMs,
                           uint16_t fanLightStartAtMs,
                           uint16_t forwardStartAtMs,
                           uint16_t forwardSteps,
                           uint16_t fogStopAtMs,
                           uint16_t fanStopAtMs,
                           uint16_t lightStopAtMs) {
  memset(&packet, 0, sizeof(packet));
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_CONTROL;
  packet.action = CONTROL_BUBBLE_CONFIG;
  packet.arg1 = reverseSteps;
  packet.arg2 = fogStartAtMs;
  packet.arg3 = fanLightStartAtMs;
  packet.arg4 = forwardStartAtMs;
  packet.arg5 = forwardSteps;
  packet.arg6 = fogStopAtMs;
  packet.arg7 = fanStopAtMs;
  packet.arg8 = lightStopAtMs;
  packet.checksum = calculatePacketChecksum(packet);
}

void cacheDefaultBubbleConfig() {
  setBubbleConfigPacket(latestBubbleConfigPacket,
                        BUBBLE_DEFAULT_REVERSE_STEPS,
                        BUBBLE_DEFAULT_FOG_START_AT_MS,
                        BUBBLE_DEFAULT_FAN_LIGHT_START_AT_MS,
                        BUBBLE_DEFAULT_FORWARD_START_AT_MS,
                        BUBBLE_DEFAULT_FORWARD_STEPS,
                        BUBBLE_DEFAULT_FOG_STOP_AT_MS,
                        BUBBLE_DEFAULT_FAN_STOP_AT_MS,
                        BUBBLE_DEFAULT_LIGHT_STOP_AT_MS);
  haveBubbleConfigPacket = true;
  Serial.print("EVENT=BUBBLE_CONFIG_CACHED SOURCE=DEFAULT REVERSE_STEPS=");
  Serial.print(latestBubbleConfigPacket.arg1);
  Serial.print(" FORWARD_STEPS=");
  Serial.println(latestBubbleConfigPacket.arg5);
}

void rememberBubbleConfig(const DreamControlEspNowPacket &packet) {
  latestBubbleConfigPacket = packet;
  haveBubbleConfigPacket = true;
  Serial.print("EVENT=BUBBLE_CONFIG_CACHED SEQ=");
  Serial.print(packet.seq);
  Serial.print(" REVERSE_STEPS=");
  Serial.print(packet.arg1);
  Serial.print(" FORWARD_STEPS=");
  Serial.println(packet.arg5);
}

void replayBubbleConfigForInput(const char *source) {
  if (!haveBubbleConfigPacket) {
    Serial.print("EVENT=BUBBLE_CONFIG_REPLAY_SKIPPED SOURCE=");
    Serial.print(source);
    Serial.println(" REASON=NO_SAVED_CONFIG");
    return;
  }

