zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
  DreamControlEspNowPacket packet = latestBubbleConfigPacket;
  packet.seq = localControlSeq++;
  packet.pcTimeMs = millis();
  packet.m5UptimeMs = millis();
  packet.checksum = 0;
  Serial.print("EVENT=BUBBLE_CONFIG_REPLAY SOURCE=");
  Serial.print(source);
  Serial.print(" SEQ=");
  Serial.print(packet.seq);
  Serial.print(" REVERSE_STEPS=");
  Serial.print(packet.arg1);
  Serial.print(" FORWARD_STEPS=");
  Serial.println(packet.arg5);
  sendControlToMicroduino(packet);
}

bool readPressureSensorRaw() {
#if PRESSURE_SENSOR_PIN >= 0
  return digitalRead(PRESSURE_SENSOR_PIN) == PRESSURE_SENSOR_ACTIVE_LEVEL;
#else
  return false;
#endif
}

bool bubbleFlowBusy(uint32_t now) {
  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0xFFFFFFFFUL;
  return haveMicStatus &&
         micAgeMs < MIC_STATUS_TIMEOUT_MS &&
         latestMicStatus.bubbleState != BUBBLE_IDLE;
}

void triggerBubbleFromInput(const char *source) {
  const uint32_t now = millis();
  if (bubbleFlowBusy(now)) {
    Serial.print("EVENT=BUBBLE_TRIGGER_IGNORED SOURCE=");
    Serial.print(source);
    Serial.println(" REASON=BUBBLE_BUSY");
    return;
  }

  pressureTriggerCount++;
  pressureLastTriggerMs = now;
  replayBubbleConfigForInput(source);
  sendLocalControl(CONTROL_BUBBLE_TRIGGER);
  Serial.print("EVENT=BUBBLE_TRIGGER SOURCE=");
  Serial.print(source);
  Serial.println(" ACTION=BUBBLE_TRIGGER");
}

void initPressureSensor() {
#if PRESSURE_SENSOR_PIN >= 0
  pinMode(PRESSURE_SENSOR_PIN, INPUT);
  pressureLastRawPressed = readPressureSensorRaw();
  pressureStablePressed = pressureLastRawPressed;
  pressurePressed = pressureStablePressed;
  Serial.print("EVENT=PRESSURE_SENSOR_READY PIN=");
  Serial.print(PRESSURE_SENSOR_PIN);
  Serial.print(" ACTIVE_LEVEL=");
  Serial.println(PRESSURE_SENSOR_ACTIVE_LEVEL == HIGH ? "HIGH" : "LOW");
#else
  pressurePressed = false;
  pressureStablePressed = false;
  pressureLastRawPressed = false;
  Serial.println("EVENT=PRESSURE_SENSOR_READY PIN=UNCONFIGURED");
#endif
  pressureLastChangeMs = millis();
}

void handlePressureSensor() {
  const uint32_t now = millis();
  const bool rawPressed = readPressureSensorRaw();
  if (rawPressed != pressureLastRawPressed) {
    pressureLastRawPressed = rawPressed;
    pressureLastChangeMs = now;
  }

  if (now - pressureLastChangeMs < PRESSURE_SENSOR_DEBOUNCE_MS) {
    pressurePressed = pressureStablePressed;
    return;
  }

  if (rawPressed == pressureStablePressed) {
    pressurePressed = pressureStablePressed;
    return;
  }

  pressureStablePressed = rawPressed;
  pressurePressed = pressureStablePressed;
  if (!pressureStablePressed) {
    return;
  }

  triggerBubbleFromInput("M5_PRESSURE");
}

void handleVibrationTrigger() {
  if (!vibrationTriggerPending) {
    return;
  }

  vibrationTriggerPending = false;
  if (!vibrationInputEnabled) {
    Serial.println("EVENT=VIBRATION_TRIGGER_IGNORED REASON=DISABLED");
    return;
  }

  triggerBubbleFromInput("ESP32S3_VIBRATION");
}

bool applyLocalControl(const DreamControlEspNowPacket &packet) {
  if (packet.action == CONTROL_VIBRATION_ENABLE) {
    vibrationInputEnabled = true;
    vibrationTriggerPending = false;
    Serial.println("EVENT=LOCAL_CONTROL ACTION=VIBRATION_ENABLE");
    return true;
  }

  if (packet.action == CONTROL_VIBRATION_DISABLE) {
    vibrationInputEnabled = false;
    vibrationTriggerPending = false;
    Serial.println("EVENT=LOCAL_CONTROL ACTION=VIBRATION_DISABLE");
    return true;
  }

  return false;
}

void handleButtons() {
  if (M5.BtnA.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_ENABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_ENABLE SOURCE=BTN_A");
  }
  if (M5.BtnC.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_DISABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_DISABLE SOURCE=BTN_C");
  }
  if (M5.BtnB.wasPressed()) {
    sendLocalControl(CONTROL_ALL_STOP);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=ALL_STOP SOURCE=BTN_B");
  }
}

void processSerialLine() {
  serialLine[serialLineIndex] = '\0';
  if (serialLineIndex == 0) {
    return;
  }

  DreamEegEspNowPacket packet = {};
  if (parseEegLine(serialLine, packet)) {
    latestEegPacket = packet;
    serialFrameCount++;
    lastSerialFrameMs = millis();
    haveEeg = true;

    Serial.print("EVENT=SERIAL_EEG_RX SEQ=");
    Serial.print(latestEegPacket.seq);
    Serial.print(" ATTENTION=");
    Serial.print(latestEegPacket.attention);
    Serial.print(" MEDITATION=");
    Serial.print(latestEegPacket.meditation);
    Serial.print(" POOR_SIGNAL=");
    Serial.println(latestEegPacket.poorSignal);

    sendEegToMicroduino();
    return;
  }

  DreamControlEspNowPacket controlPacket = {};
  if (parseControlLine(serialLine, controlPacket)) {
    controlRxCount++;
    Serial.print("EVENT=SERIAL_CMD_RX SEQ=");
    Serial.print(controlPacket.seq);
    Serial.print(" ACTION=");
    Serial.println(controlPacket.action);
    if (applyLocalControl(controlPacket)) {
      return;
    }
    if (controlPacket.action == CONTROL_BUBBLE_CONFIG) {
      rememberBubbleConfig(controlPacket);
    }
    sendControlToMicroduino(controlPacket);
    return;
  }

  serialErrorCount++;
  Serial.print("EVENT=SERIAL_PARSE_FAIL TEXT=");
  Serial.println(serialLine);
}

void handleSerialInput() {
  while (Serial.available() > 0) {
    const char value = static_cast<char>(Serial.read());
    if (value == '\r') {
      continue;
    }

    if (value == '\n') {
      processSerialLine();
      serialLineIndex = 0;
      continue;
    }

    if (value < 0x20 || value > 0x7E) {
      continue;
    }

    if (serialLineIndex < SERIAL_LINE_BUFFER_SIZE - 1) {
      serialLine[serialLineIndex++] = value;
    } else {
      serialLineIndex = 0;
      serialErrorCount++;
      Serial.println("EVENT=SERIAL_LINE_TOO_LONG");
    }
  }
}

void onEspNowSent(const uint8_t *macAddress, esp_now_send_status_t status) {
  lastSendStatus = status;
  if (status != ESP_NOW_SEND_SUCCESS) {
    espNowSendFailCount++;
  }
}

void handleEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  if (dataLength == static_cast<int>(sizeof(DreamVibrationStatusPacket))) {
    DreamVibrationStatusPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (packet.magic != DREAM_PACKET_MAGIC ||
        packet.version != DREAM_PROTOCOL_VERSION ||
        packet.type != DREAM_PACKET_VIBRATION_STATUS) {
      return;
    }

    const uint16_t expectedChecksum = calculatePacketChecksum(packet);
    if (packet.checksum != static_cast<uint8_t>(expectedChecksum & 0xFF)) {
      return;
    }

    latestVibrationStatus = packet;
    haveVibrationStatus = true;
    lastVibrationStatusMs = millis();
    const bool vibrationDetected = packet.vibrationDetected != 0;
    if (vibrationDetected && !lastVibrationDetected) {
      if (vibrationInputEnabled) {
        vibrationTriggerCount++;
        vibrationTriggerPending = true;
        vibrationLastTriggerMs = millis();
      } else {
        Serial.println("EVENT=VIBRATION_TRIGGER_IGNORED REASON=DISABLED");
      }
    }
    lastVibrationDetected = vibrationDetected;
    return;
  }

  if (dataLength != static_cast<int>(sizeof(DreamMicStatusPacket))) {
    return;
  }

